src/Documents/ВводОстатков/ВводОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
	<name>ВводОстатков</name>
	<registerRecords>AccumulationRegister.ВзаиморасчетыСКассирами</registerRecords>
	<registerRecords>AccumulationRegister.ВзаиморасчетыСАгенствами</registerRecords>
	<registerRecords>AccumulationRegister.ДвижениеДенежныхСредств</registerRecords>
	<attributes>
		<name>ВидОперации</name>
		<type>
			<types>EnumRef.ВидыВводаНачальныхОстатков</types>
		</type>
	</attributes>
	<tabularSections>
		<name>ОстатокПоКассе</name>
		<attributes>
			<name>Касса</name>
			<type>
				<types>CatalogRef.Касса</types>
			</type>
		</attributes>
		<attributes>
			<name>Сумма</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
	</tabularSections>
	<tabularSections>
		<name>ОстатокПоЗадолженности</name>
		<attributes>
			<name>Кассир</name>
			<type>
				<types>CatalogRef.Кассир</types>
			</type>
		</attributes>
		<attributes>
			<name>Сумма</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>ВалютаВзаиморасчетов</name>
			<type>
				<types>CatalogRef.Валюта</types>
			</type>
		</attributes>
		<attributes>
			<name>Статус</name>
			<type>
				<types>String</types>
				<stringQualifiers>
					<length>10</length>
				</stringQualifiers>
			</type>
		</attributes>
	</tabularSections>
	<tabularSections>
		<name>ОстатокКредиторскойЗадолженности</name>
		<attributes>
			<name>Поставщик</name>
			<type>
				<types>CatalogRef.Агенство</types>
			</type>
		</attributes>
		<attributes>
			<name>Сумма</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>Статус</name>
			<type>
				<types>String</types>
				<stringQualifiers>
					<length>10</length>
				</stringQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>ВалютаВзаиморасчетов</name>
			<type>
				<types>CatalogRef.Валюта</types>
			</type>
		</attributes>
	</tabularSections>
</mdclass:Document>

src/Enums/ВидыВводаНачальныхОстатков/ВидыВводаНачальныхОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
	<name>ВидыВводаНачальныхОстатков</name>
	<enumValues>
		<name>ОстатокПоКассаБанковскийСчет</name>
	</enumValues>
	<enumValues>
		<name>ЗадолженностьПередПоставщиками</name>
	</enumValues>
	<enumValues>
		<name>ЗадолженностьКассиров</name>
	</enumValues>
</mdclass:Enum>

src/Documents/ВводОстатков/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Параметры.ВидОперации="Сальдо" Тогда
		Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.ВидыВводаНачальныхОстатков.ОстатокПоКассаБанковскийСчет");
		Элементы.ГруппаОстатокПоКассе.Видимость=Истина;
		Элементы.ГруппаОстатокПоЗадолженности.Видимость=Ложь;
		Элементы.ГруппаОстатокКредиторскойЗадолженности.Видимость=Ложь;
		ЭтаФорма.Заголовок="Ввод начальных остатков по кассе";
	ИначеЕсли Параметры.ВидОперации="Дебит" Тогда
		Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.ВидыВводаНачальныхОстатков.ЗадолженностьКассиров");
		Элементы.ГруппаОстатокПоКассе.Видимость=Ложь;
		Элементы.ГруппаОстатокПоЗадолженности.Видимость=Истина;
		Элементы.ГруппаОстатокКредиторскойЗадолженности.Видимость=Ложь;
		ЭтаФорма.Заголовок="Ввод начальных остатков по задолженности кассиров";
	ИначеЕсли Параметры.ВидОперации="Кредит" Тогда
		Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.ВидыВводаНачальныхОстатков.ЗадолженностьПередПОставщиками");
		Элементы.ГруппаОстатокКредиторскойЗадолженности.Видимость=Истина;
		Элементы.ГруппаОстатокПоЗадолженности.Видимость=Ложь;
		Элементы.ГруппаОстатокПоКассе.Видимость=Ложь;
		ЭтаФорма.Заголовок="Ввод начальных остатков перед поставщиками";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОстатокКредиторскойЗадолженностиСуммаПриИзменении(Элемент)
	Данные=Элементы.ОстатокКредиторскойЗадолженности.ТекущиеДанные;
	Данные.Статус="";
	Если Данные.Сумма<0 Тогда
		Данные.Статус="Аванс"	
	Иначе
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОстатокПоЗадолженностиСуммаПриИзменении(Элемент)
	Данные=Элементы.ОстатокПоЗадолженности.ТекущиеДанные;
	Данные.Статус="";
	Если Данные.Сумма<0 Тогда
		Данные.Статус="Аванс"	
	Иначе
	КонецЕсли;	
КонецПроцедуры
